<?php
include 'main/main.php';
$title = 'Вы заблудились';
include 'main/head.php';
?>
    <h1>Ошибка!</h1>
    <br>
    › Данная страница не существует.<br/>
    › Нет доступа к данной странице.<br/>
    › Неправильно введен адрес страницы.<br/>
    › Глупые разработчики сделали ссылку на страницу, но саму страницу - нет.
    <br>
    <h1>Что делать?</h1>
    <br>
    › Проверьте правильность введенного адреса.<br/>
    › Посетить страницу позднее.<br/>
    › Понять и простить, тут явно проблема у разработчика.<br/>
<?php
include 'main/foot.php';
?>