<!DOCTYPE html>
<html lang="ru">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <link rel="shortcut icon" href="/files/icons/energy.png"/>
    <link rel="stylesheet" href="/style/fonts.css" type="text/css"/>
    <link rel="stylesheet" href="/style/start.css" type="text/css"/>
    <title>BRIGADA.MOBI</title>
</head>
<body>
<div class="about center">
    <div class="variant">
        <div class="variant-text">
            <span class="variant-text-span">Соглашение</span>
        </div>
    </div>
</div>
<div class="text">
    <strong>1. Общие условия</strong><hr/>
    1.1. В качестве Пользователей Игры могут выступать дееспособные лица старше 14 лет.
    <br/>
    1.2. Лицензия на базовую версию Игры предоставляется безвозмездно и обеспечивает возможность прохождения Игры в целом без необходимости приобретения расширенной версии Игры.
    <br/>
    1.3. Перечень функциональных возможностей, использование которых требует предварительной регистрации Пользователя, приобретение лицензии на расширенную версию Игры и/или оплаты лицензионного вознаграждения определяется по единоличному усмотрению Администрации и может время от времени изменяться.
    <br/>
    1.4. Указывая при совершении платежа идентификационные данные, связанные с аккаунтом Пользователя, вы подтверждаете, что являетесь Пользователем, зарегистрировавшим данный аккаунт или действуете по его поручению и в его интересах. Зачисление оплаты на лицевой счет Пользователя Игры производится на основании данных, предоставленных Оператором.
    <br/>
    1.5. Некоторые технические, организационные, финансовые и коммерческие условия использования Игры, в том числе функциональных возможностей ее расширенной версии, могут доводиться до сведения Пользователей путем отдельного размещения информации в Игре.
</div>
<div class="text">
    <strong>2. Безопасность</strong><hr/>
    2.1. Пользователь обязуется не передавать никому пароль от своей учетной записи на сайте (в том числе администрации).
    <br/>
    2.2. Пользователь обязуется не использовать сторонние программы/скрипты, что могут давать игровое преимущество перед остальными игроками (в том числе автокликеры).
    <br/>
    2.3. Администрация игрового проекта оставляет за собой право хранить IP адреса игроков, в том числе для передачи правоохранительным органам в случаее запроса таковых.
    <br/>
    2.4. Администрация может заблокировать учетную запись игрока, в случае сомнения в правах на ее использование, в целях предупреждения кражи аккаунта и личной информации связанной с ним. Администрация в праве потребовать доказательства владения аккаунтом, чтобы удостоверится, что учетная запись не была украдена.
    <br/>
    2.5. Администрация не несет ответственность, если игрок забыл данные от своего аккаунта. Восстановление аккаунта происходит только через специальную функцию "восстановить аккаунт", где потребуется email, который игрок указал в качестве способа восстановления.
    <br/>
    2.6. Администрация не несет ответственность за потраченные, либо удаленные игровые ценности игрока, чей аккаунт был взломан.
</div>
<div class="text">
    <strong>3. Внутреигровые покупки</strong><hr/>
    3.1. В данной игре имеются внутреигровые покупки (далее - Донат), используя реальные материальные средства.
    <br/>
    3.2. Донат в игру является добровольным пожертвованием игроком реальных материальных средств, за что получает внутреигровые ценности.
    <br/>
    3.3. Донат предоставляется "здесь и сейчас" и не подлежит возврату.
    <br/>
    3.4. Администрация не несет ответственность за утерю игроком внутреигровых ценностей, полученных путем доната в игру, в случаях утери доступа к аккаунту, либо передачи другого игроку.
</div>
<div class="text">
    Принимая настоящее Соглашение, вы понимаете и признаете, что:
    <br/>
    4.1. Игра предназначена для личных, семейных, домашних и иных не связанных с осуществлением предпринимательской деятельности нужд физических лиц. Использование Игры в коммерческих целях, в том числе для извлечения любых доходов, не допускается.
    <br/>
    4.2. Игра предоставляется на условиях "как есть", в связи с чем вам не представляются какие-либо гарантии, что Игра будет соответствовать вашим требованиям; доступ к ней будет предоставляться непрерывно, быстро, надежно и без ошибок; результаты, которые могут быть получены с использованием Игры, будут точными и надежными; качество какого-либо продукта, информации и прочего контента, полученного с использованием Игры, будет соответствовать вашим ожиданиям; все ошибки в программном обеспечении Игры будут исправлены.
    <br/>
    4.3. Поскольку Игра находится на стадии постоянного дополнения и обновления новых функциональных возможностей, их форма и характер могут время от времени меняться без вашего предварительного уведомления. Администрация вправе по собственному усмотрению прекратить (временно или окончательно) предоставление доступа к Игре (или каких-либо отдельных ее функциональных возможностей) всем Пользователям вообще или вам, в частности, без вашего предварительного уведомления.
    <br/>
    4.4. Дизайн Игры, ее программное обеспечение и техническая поддержка рассчитаны на доступ через мобильный терминал посредством радиотелефонной (сотовой) связи по протоколам WAP и/или GPRS, при доступе с других устройств и по другим протоколам Игра может работать некорректно.
    <br/>
    4.5. Администрация не несет ответственность за качество связи и скорость передачи данных. Все вопросы по устойчивости связи, ее настройкам, настройкам мобильного телефона и другим подобным техническим проблемам, следует направлять Оператору.
    <br/>
    4.6. Стоимость WAP/GPRS-трафика определяется соглашением с Оператором. Вопросы, связанные с оплатой WAP\GPRS-трафика, необходимо решать с Оператором. Претензии по оплате лицензии на расширенную версию Игры через Операторов или Партнеров принимаются только после подтверждения Пользователем обращения к указанным лицам за розыском уплаченных денежных средств и подтверждении ими факта перечисления денежных средств Пользователя на счет Администрации в полном объеме.
    <br/>
    4.7. Администрация никак не связана с материалами, размещенными Пользователями в Игре (далее по тексту – "контент"), и не осуществляет проверку содержания, подлинности и безопасности этих материалов, а равно их соответствия требованиям применимого права, и наличия у Пользователей необходимого объема прав на их использование.
    <br/>
    4.8. В частности вам запрещается использование Игры для:
    <br/>
    - размещения и/или распространения контрафактных материалов;
    <br/>
    - размещения и/или распространения материалов порнографического характера, а равно пропаганды порнографии и детской эротики, и рекламы интимных услуг;
    <br/>
    - размещения и/или распространения любой иной запрещенной информации, включая материалы, экстремистского характера, а также направленных на ущемление прав и свобод человека по признакам расовой и национальной принадлежности, вероисповедания, языка, и пола, подстрекающие к совершению насильственных действий в отношении человека, либо к бесчеловечному обращению с животными, призывающие к совершению иных противоправных действий, в том числе разъясняющие порядок изготовления и применения оружия, наркотических средств и их прекурсов, и т.д.;
    <br/>
    - преимущественного или исключительного размещения ссылок на другие сайты;
    <br/>
    - распространения рекламных материалов в личных сообщениях иным Пользователям без получения их предварительного согласия на их получение (СПАМ);
    <br/>
    - совершения иных действий, предусмотренных Правилами игры или Правилами форума.
    <br/>
    4.9. Несмотря на установленный запрет, при использовании Игры вы можете получить контент, который можете счесть содержащим информацию оскорбительного или непристойного характера, а также нарушающий применимое право и права третьих лиц.
    <br/>
    4.10. Всю ответственность за содержание контента и соответствие его требованиям применимого права несет лицо, создавшее данный контент и (или) разместившее его в Игре.
    <br/>
    4.11. Игра может содержать ссылки на другие ресурсы, при этом Администрация не несет никакой ответственности за доступность этих ресурсов, за их контент и рекламные материалы, а также за любые последствия, связанные с использованием данных ресурсов, их контента или рекламы.
    <br/>
    4.12. Вы несете исключительную ответственность за любое нарушение обязательств, установленных настоящим Соглашением и (или) применимым правом, а также за все последствия таких нарушений (включая любые убытки или ущерб, которые может понести владелец Игры и иные третьи лица).
    <br/>
    4.13. В случае возникновения каких-либо претензий третьих лиц в отношении нарушения любых имущественных и/или личных неимущественных прав третьих лиц, а равно установленных законодательством запретов или ограничений вы обязаны по требованию Администрации пройти официальную идентификацию, предоставив Администрации нотариально заверенное обязательство урегулировать возникшие претензии собственными силами и за свой счет с указанием своих паспортных данных.
    <br/>
    4.14. Администрация оставляет за собой право удалить любой контент из Игры либо временно ограничить доступ к нему в одностороннем порядке без объяснения причин и выплаты компенсации.
    <br/>
    4.15. В случае нарушений Пользователем условий настоящего Соглашения, включая Обязательные документы, а равно требований законодательства, Администрация оставляет за собой право ограничить или прекратить доступ Пользователя к Игре целиком либо к любым функциональным возможностям Игры (форум, чат, файловый архив и т.п.).
    <br/>
    4.16. В случае привлечения Администрации к ответственности или наложения на него взыскания в связи с допущенными вами нарушениями прав и/или интересов третьих лиц, а равно установленных законодательством запретов или ограничений, вы обязаны в полном объеме возместить убытки Администрации.
    <br/>
    4.17. Администрация устраняется от какой бы то ни было ответственности в связи с допущенными Вами нарушениями, а также причинением вам вреда или убытков при указанных выше обстоятельствах.
    <br/>
    4.18. При любых обстоятельствах ответственность Администрации ограничена 1 000 (Одной тысячью) рублей и возлагается на него при наличии в его действиях вины.
    <br/>
    4.19. В случае обнаружения нарушения ваших прав и/или интересов в связи с предоставлением Игры, в том числе незаконных размещением материалов иным Пользователем, вам следует сообщить об этом Администрации. Для этого вам необходимо направить Администрации письменное уведомление с подробным изложением обстоятельств нарушения и гипертекстовой ссылкой на страницу Игры, содержащую материалы, которыми нарушаются ваши права и/или интересы по электронному адресу: admin (at) brigada (dot) mobi.
    <br/>
    4.20. Ввиду предоставления лицензии на использование Игры в базовой версии на безвозмездной основе к отношениям Сторон по такой лицензии не применимы положения законодательства о защите прав потребителей.
    <br/>
    4.21. Наличие или отсутствие в действиях Пользователя нарушения Соглашения, включая Обязательные документы, относится к организации игрового процесса и вытекает из условий проведения игры. Игровые санкции предусмотрены для обеспечения баланса интересов всех Пользователей, участвующих в Игре, и являются обязательной частью игрового процесса.
    <br/>
    4.22. Контроль за соблюдением Соглашения, включая Обязательные документы, возложен на Администрацию, решения которого окончательны и обжалованию не подлежат.
    <br/>
    4.23. Администрация оставляет за собой право изменения/дополнения данного соглашения в любое время, без уведомления и согласия на это Пользователей.
</div>
<small>Последнее изменение соглашения: 11.07.2022 г.</small>
<div class="footer">
    xynd3r &copy; 2022 г.
    <hr/>
    <a href="/rules/">Пользовательское соглашение</a> / <a href="/refferals/">Реферальная программа</a>
</div>
</body>
</html>