<?php
const CLAN_CREATE_RUBLES = 100;
const CLAN_CREATE_REPUTE = 1000;

$level = [0, 0, 100, 210, 330, 460, 600, 750, 910, 1080, 1260, 1450, 1650, 1860, 2080, 2310, 2550, 2800, 3060, 3330, 3610, 3900, 4200, 4510, 4830, 5160, 5500, 5850, 6210, 6580, 6960, 7350, 7750, 8160, 8580, 9010, 9450, 9900, 10360, 10830, 11310, 11800, 12300, 12810, 13330, 13860, 14400, 14950, 15510, 16080, 16660, 17250, 17850, 18460, 19080, 19710, 20350, 21000, 21660, 22330, 23010, 23700, 24400, 25110, 25830, 26560, 27300, 28050, 28810, 29580, 30360, 31150, 31950, 32760, 33580, 34410, 35250, 36100, 36960, 37830, 38710, 39600, 40500, 41410, 42330, 43260, 44200, 45150, 46110, 47080, 48060, 49050, 50050, 51060, 52080, 53110, 54150, 55200, 56260, 57330, 58410, 59500, 60600, 61710, 62830, 63960, 65100, 66250, 67410, 68580, 69760, 70950, 72150, 73360, 74580, 75810, 77050, 78300, 79560, 80830, 82110, 83400, 84700, 86010, 87330, 88660, 90000, 91350, 92710, 94080, 95460, 96850, 98250, 99660, 101080, 102510, 103950, 105400, 106860, 108330, 109810, 111300, 112800, 114310, 115830, 117360, 118900, 120450, 122010, 123580];
$buyBiz = [0, 30, 50, 70, 100, 150, 200, 250, 300, 500];
$access = ['Игрок', 'Агент поддержки', 'Модератор', 'Администратор', 'Разработчик'];
$slot = [
    'head' => ['name' => 'голова'],
    'top' => ['name' => 'верхняя одежда'],
    'body' => ['name' => 'тело'],
    'boot' => ['name' => 'ноги'],
    'accessory' => ['name' => 'аксессуар'],
];

$typeRoom = [
    'all' => 'для всех',
    'invite' => 'по приглашениям',
    'solo' => 'в одиночку',
    'opg' => 'для участников ОПГ'
];
$atrb = [
    'power' => 'силы удара',
    'shield' => 'брони',
    'criticalDamage' => 'критического урона (%)',
    'criticalChance' => 'шанса критического удара',
    'max_hp' => 'макс. здоровья',
    'max_energy' => 'макс. энергии',
];
$quality = [
    'trash' => 'дешёвка',
    'normal' => 'обычное',
    'rare' => 'блатное',
    'heroic' => 'авторитетное',
    'souvenir' => 'сувенирное'
];
$how = [
    'shop' => 'покупка у торговца',
    'random' => 'случайный лут',
    'craft' => 'изготовление у мастера',
    'boss' => 'награда с боссов',
    'none' => 'эксклюзив'
];
$object = [
    'none' => 'предмет',
    'hp' => 'здоровье',
    'energy' => 'энергия',
    'medal' => 'медаль'
];
$method = isset($_GET['method']) ? trim($_GET['method']) : '';
$control = isset($_GET['control']) ? trim($_GET['control']) : '';
$listNPC = [
    'quest' => 'Задание от',
    'dealer' => 'Контрабандист',
    'equipment' => 'Торговец экипировкой',
    'objects' => 'Торговец предметами',
    'change' => 'Обменьщик',
    'food' => 'Торговец припасами',
    'bank' => 'Банкир',
    'craft' => 'Мастер',
    'gaming' => 'Шулер',
    'digger' => 'Диггер'
];
$rankGrp = ['Бык', 'Бригадир', 'Бандит', 'Авторитет', 'Лидер ОПГ'];

$maps = [
    1 => [
        1 => [
            'title' => 'Стрельнуть сигарет',
            'max' => 5,
            'repute' => 1,
            'bolts' => 1,
            'exp' => 1,
            'energy' => 1
        ],
        2 => [
            'title' => 'Перетереть с друзьями',
            'max' => 5,
            'repute' => 2,
            'bolts' => 2,
            'exp' => 3,
            'energy' => 3
        ],
        3 => [
            'title' => 'Пугнуть малолеток',
            'max' => 5,
            'repute' => 2,
            'bolts' => 3,
            'exp' => 4,
            'energy' => 4
        ],
        4 => [
            'title' => 'Подкатить к девушкам',
            'max' => 5,
            'repute' => 2,
            'bolts' => 1,
            'exp' => 5,
            'energy' => 5
        ],
        5 => [
            'title' => 'Подтянуться на турнике',
            'max' => 5,
            'repute' => 3,
            'bolts' => 3,
            'exp' => 7,
            'energy' => 7
        ],
        6 => [
            'title' => 'Собрать братков',
            'max' => 5,
            'repute' => 3,
            'bolts' => 2,
            'exp' => 8,
            'energy' => 8
        ],
        7 => [
            'title' => 'Обнести ларёк',
            'max' => 5,
            'repute' => 3,
            'bolts' => 10,
            'exp' => 10,
            'energy' => 10
        ],
    ],
    2 => [
        1 => [
            'title' => 'Поиск бинокля',
            'max' => 5,
            'repute' => 0,
            'bolts' => 2,
            'exp' => 10,
            'energy' => 5
        ],
        2 => [
            'title' => 'Выследить комерса',
            'max' => 5,
            'repute' => 2,
            'bolts' => 3,
            'exp' => 7,
            'energy' => 7
        ],
        3 => [
            'title' => 'Спланировать нападение',
            'max' => 5,
            'repute' => 2,
            'bolts' => 4,
            'exp' => 7,
            'energy' => 7
        ],
        4 => [
            'title' => 'Запугать охраника',
            'max' => 5,
            'repute' => 2,
            'bolts' => 7,
            'exp' => 8,
            'energy' => 8
        ],
        5 => [
            'title' => 'Найти быков',
            'max' => 8,
            'repute' => 3,
            'bolts' => 8,
            'exp' => 8,
            'energy' => 2
        ],
        6 => [
            'title' => 'Вооружиться битами',
            'max' => 8,
            'repute' => 4,
            'bolts' => 10,
            'exp' => 8,
            'energy' => 8
        ],
        7 => [
            'title' => 'Подмять точку',
            'max' => 10,
            'repute' => 3,
            'bolts' => 25,
            'exp' => 10,
            'energy' => 10
        ],
    ],
3 => [
        1 => [
            'title' => 'Пугнуть лоха',
            'max' => 6,
            'repute' => 2,
            'bolts' => 4,
            'exp' => 4,
            'energy' => 3
        ],
        2 => [
            'title' => 'Зайти в гости к Анжелке',
            'max' => 6,
            'repute' => 2,
            'bolts' => 5,
            'exp' => 5,
            'energy' => 4
        ],
        3 => [
            'title' => 'Спрятаться от ментов',
            'max' => 6,
            'repute' => 2,
            'bolts' => 7,
            'exp' => 7,
            'energy' => 4
        ],
        4 => [
            'title' => 'Вскрыть гараж',
            'max' => 8,
            'repute' => 3,
            'bolts' => 8,
            'exp' => 8,
            'energy' => 5
        ],
        5 => [
            'title' => 'Снять магнитолу',
            'max' => 8,
            'repute' => 3,
            'bolts' => 8,
            'exp' => 8,
            'energy' => 5
        ],
        6 => [
            'title' => 'Толкнуть магнитолу барыге',
            'max' => 10,
            'repute' => 3,
            'bolts' => 10,
            'exp' => 10,
            'energy' => 8
        ],
        7 => [
            'title' => 'Замутить ствол',
            'max' => 12,
            'repute' => 3,
            'bolts' => 15,
            'exp' => 10,
            'energy' => 10
        ],
    ],
    4 => [
        1 => [
            'title' => 'Задание 1',
            'max' => 5,
            'repute' => 2,
            'bolts' => 3,
            'exp' => 3,
            'energy' => 3
        ],
        2 => [
            'title' => 'Задание 2',
            'max' => 5,
            'repute' => 2,
            'bolts' => 4,
            'exp' => 4,
            'energy' => 4
        ],
        3 => [
            'title' => 'Задание 3',
            'max' => 5,
            'repute' => 2,
            'bolts' => 4,
            'exp' => 4,
            'energy' => 4
        ],
        4 => [
            'title' => 'Задание 4',
            'max' => 7,
            'repute' => 2,
            'bolts' => 5,
            'exp' => 5,
            'energy' => 5
        ],
        5 => [
            'title' => 'Задание 5',
            'max' => 7,
            'repute' => 2,
            'bolts' => 5,
            'exp' => 5,
            'energy' => 5
        ],
        6 => [
            'title' => 'Задание 6',
            'max' => 10,
            'repute' => 3,
            'bolts' => 8,
            'exp' => 8,
            'energy' => 8
        ],
        7 => [
            'title' => 'Задание 7',
            'max' => 10,
            'repute' => 3,
            'bolts' => 10,
            'exp' => 10,
            'energy' => 10
        ],
    ],
    5 => [
        1 => [
            'title' => 'Задание 1',
            'max' => 7,
            'repute' => 2,
            'bolts' => 4,
            'exp' => 4,
            'energy' => 4
        ],
        2 => [
            'title' => 'Задание 2',
            'max' => 7,
            'repute' => 2,
            'bolts' => 5,
            'exp' => 5,
            'energy' => 5
        ],
        3 => [
            'title' => 'Задание 3',
            'max' => 8,
            'repute' => 3,
            'bolts' => 7,
            'exp' => 7,
            'energy' => 7
        ],
        4 => [
            'title' => 'Задание 4',
            'max' => 8,
            'repute' => 3,
            'bolts' => 8,
            'exp' => 8,
            'energy' => 8
        ],
        5 => [
            'title' => 'Задание 5',
            'max' => 10,
            'repute' => 3,
            'bolts' => 8,
            'exp' => 8,
            'energy' => 8
        ],
        6 => [
            'title' => 'Задание 6',
            'max' => 10,
            'repute' => 3,
            'bolts' => 10,
            'exp' => 10,
            'energy' => 10
        ],
        7 => [
            'title' => 'Задание 7',
            'max' => 12,
            'repute' => 3,
            'bolts' => 12,
            'exp' => 12,
            'energy' => 12
        ],
    ],
    6 => [
        1 => [
            'title' => 'Задание 1',
            'max' => 8,
            'repute' => 2,
            'bolts' => 5,
            'exp' => 5,
            'energy' => 5
        ],
        2 => [
            'title' => 'Задание 2',
            'max' => 8,
            'repute' => 2,
            'bolts' => 5,
            'exp' => 5,
            'energy' => 8
        ],
        3 => [
            'title' => 'Задание 3',
            'max' => 10,
            'repute' => 3,
            'bolts' => 7,
            'exp' => 7,
            'energy' => 8
        ],
        4 => [
            'title' => 'Задание 4',
            'max' => 10,
            'repute' => 3,
            'bolts' => 8,
            'exp' => 8,
            'energy' => 8
        ],
        5 => [
            'title' => 'Задание 5',
            'max' => 12,
            'repute' => 3,
            'bolts' => 8,
            'exp' => 8,
            'energy' => 10
        ],
        6 => [
            'title' => 'Задание 6',
            'max' => 12,
            'repute' => 3,
            'bolts' => 10,
            'exp' => 10,
            'energy' => 10
        ],
        7 => [
            'title' => 'Задание 7',
            'max' => 15,
            'repute' => 3,
            'bolts' => 12,
            'exp' => 12,
            'energy' => 15
        ],
    ],
    7 => [
        1 => [
            'title' => 'Задание 1',
            'max' => 8,
            'repute' => 2,
            'bolts' => 5,
            'exp' => 5,
            'energy' => 5
        ],
        2 => [
            'title' => 'Задание 2',
            'max' => 8,
            'repute' => 2,
            'bolts' => 8,
            'exp' => 8,
            'energy' => 8
        ],
        3 => [
            'title' => 'Задание 3',
            'max' => 10,
            'repute' => 3,
            'bolts' => 8,
            'exp' => 8,
            'energy' => 8
        ],
        4 => [
            'title' => 'Задание 4',
            'max' => 10,
            'repute' => 3,
            'bolts' => 8,
            'exp' => 8,
            'energy' => 8
        ],
        5 => [
            'title' => 'Задание 5',
            'max' => 12,
            'repute' => 3,
            'bolts' => 10,
            'exp' => 10,
            'energy' => 10
        ],
        6 => [
            'title' => 'Задание 6',
            'max' => 12,
            'repute' => 3,
            'bolts' => 10,
            'exp' => 10,
            'energy' => 10
        ],
        7 => [
            'title' => 'Задание 7',
            'max' => 15,
            'repute' => 3,
            'bolts' => 15,
            'exp' => 15,
            'energy' => 15
        ],
    ],
    8 => [
        1 => [
            'title' => 'Задание 1',
            'max' => 8,
            'repute' => 2,
            'bolts' => 8,
            'exp' => 8,
            'energy' => 8
        ],
        2 => [
            'title' => 'Задание 2',
            'max' => 8,
            'repute' => 2,
            'bolts' => 8,
            'exp' => 8,
            'energy' => 8
        ],
        3 => [
            'title' => 'Задание 3',
            'max' => 10,
            'repute' => 3,
            'bolts' => 8,
            'exp' => 8,
            'energy' => 8
        ],
        4 => [
            'title' => 'Задание 4',
            'max' => 10,
            'repute' => 3,
            'bolts' => 8,
            'exp' => 8,
            'energy' => 8
        ],
        5 => [
            'title' => 'Задание 5',
            'max' => 12,
            'repute' => 3,
            'bolts' => 12,
            'exp' => 12,
            'energy' => 12
        ],
        6 => [
            'title' => 'Задание 6',
            'max' => 12,
            'repute' => 3,
            'bolts' => 15,
            'exp' => 15,
            'energy' => 15
        ],
        7 => [
            'title' => 'Задание 7',
            'max' => 15,
            'repute' => 4,
            'bolts' => 15,
            'exp' => 15,
            'energy' => 15
        ],
    ],
    9 => [
        1 => [
            'title' => 'Задание 1',
            'max' => 10,
            'repute' => 2,
            'bolts' => 8,
            'exp' => 8,
            'energy' => 8
        ],
        2 => [
            'title' => 'Задание 2',
            'max' => 10,
            'repute' => 2,
            'bolts' => 8,
            'exp' => 8,
            'energy' => 8
        ],
        3 => [
            'title' => 'Задание 3',
            'max' => 12,
            'repute' => 3,
            'bolts' => 8,
            'exp' => 8,
            'energy' => 8
        ],
        4 => [
            'title' => 'Задание 4',
            'max' => 12,
            'repute' => 3,
            'bolts' => 8,
            'exp' => 8,
            'energy' => 10
        ],
        5 => [
            'title' => 'Задание 5',
            'max' => 10,
            'repute' => 3,
            'bolts' => 12,
            'exp' => 12,
            'energy' => 12
        ],
        6 => [
            'title' => 'Задание 6',
            'max' => 10,
            'repute' => 3,
            'bolts' => 15,
            'exp' => 15,
            'energy' => 15
        ],
        7 => [
            'title' => 'Задание 7',
            'max' => 15,
            'repute' => 4,
            'bolts' => 15,
            'exp' => 15,
            'energy' => 15
        ],
    ],
    10 => [
        1 => [
            'title' => 'Задание 1',
            'max' => 10,
            'repute' => 2,
            'bolts' => 8,
            'exp' => 8,
            'energy' => 8
        ],
        2 => [
            'title' => 'Задание 2',
            'max' => 10,
            'repute' => 2,
            'bolts' => 8,
            'exp' => 8,
            'energy' => 8
        ],
        3 => [
            'title' => 'Задание 3',
            'max' => 12,
            'repute' => 3,
            'bolts' => 8,
            'exp' => 8,
            'energy' => 8
        ],
        4 => [
            'title' => 'Задание 4',
            'max' => 12,
            'repute' => 3,
            'bolts' => 8,
            'exp' => 8,
            'energy' => 10
        ],
        5 => [
            'title' => 'Задание 5',
            'max' => 10,
            'repute' => 3,
            'bolts' => 12,
            'exp' => 12,
            'energy' => 12
        ],
        6 => [
            'title' => 'Задание 6',
            'max' => 10,
            'repute' => 3,
            'bolts' => 15,
            'exp' => 15,
            'energy' => 15
        ],
        7 => [
            'title' => 'Задание 7',
            'max' => 15,
            'repute' => 4,
            'bolts' => 15,
            'exp' => 15,
            'energy' => 15
        ],
    ],
];